
#include "common.h"


/*选择身份界面*/
int identity_view(void)
{
	system("clear");

	printf("\n\n\n\n\033[5;;0m\033[1m-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-欢迎进入中国福利彩票系统-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--*-*-\033[1m\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t1 管理员\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t2 公证员\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t3 普通用户\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t0 退出\t\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--*-*-*\n\n");
	printf("请选择您的身份: ");
	int choice = -1;
	scanf("%d", &choice);
	FLUSH();
	return choice;
}


int user_main_view(void)
{
	system("clear");
	printf("\n\n\n\n-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-欢迎进入中国福利彩票系统-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t\t1 注册\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t\t2 登录\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t\t0 退出\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--*-*-*\n\n");
	printf("请输入您的选择: ");
	int choice = -1;
	scanf("%d", &choice);
	FLUSH();
	return choice;
}


int user_view(void)
{
	printf("\n\n\n\n-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-欢迎进入中国福利彩票用户中心-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t1 充值\t\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t2 查看个人信息\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t3 修改个人信息\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t4 往期中奖情况\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t5 购买彩票\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t6 兑取奖励\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t7 益智游戏\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t8 注销用户\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t0 退出\t\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--*-*-*\n\n");
	printf("请输入您的选择: ");
	int choice = -1;
	scanf("%d", &choice);
	FLUSH();
	return choice;
}


int admin_view(void)
{
	printf("\n\n\n\n-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-欢迎进入中国福利彩票管理员中心-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t1 发行彩票\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t2 查看往期彩票\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t3 查看彩民信息\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t4 根据彩民金额排序\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t5 根据彩民余额区间查询彩民\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t0 注销\t\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--*-*-*\n\n");
	printf("请输入您的选择: ");
	int choice = -1;
	scanf("%d", &choice);
	FLUSH();
	return choice;
}



int nottery_view(void)
{
	printf("\n\n\n\n-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-欢迎进入中国福利彩票公证员中心-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t1 彩票开奖\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t2 查看彩票信息\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-\t\t\t\t\t0 注销\t\t\t\t\t\t\t-*-*-*-*-*-\n\n");
	printf("-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--*-*-*\n\n");
	printf("请输入您的选择: ");
	int choice = -1;
	scanf("%d", &choice);
	FLUSH();
	return choice;
}



